# Brewfile - The Modern Dev Manifest

# --- TAPS (Repositories) ---
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "leoafarias/fvm"

# ==============================================
# 1. CORE CLI TOOLS (The Essentials)
# ==============================================
brew "git"
brew "gh"               # GitHub CLI
brew "zoxide"           # Smarter 'cd'
brew "eza"              # Modern 'ls'
brew "bat"              # Modern 'cat'
brew "ripgrep"          # Blazing fast grep
brew "jq"               # JSON processor
brew "starship"         # High-performance shell prompt
brew "mas"              # Mac App Store CLI

# ==============================================
# 2. DEV STACKS (Rust, Web, Mobile)
# ==============================================
# Rust
brew "rustup-init"
brew "bacon"            # Background rust code checker
brew "cargo-binstall"   # Binary installer

# Web
brew "fnm"              # Fast Node Manager (Rust-based)
brew "pnpm"             # Efficient Package Manager

# Mobile
brew "fvm"              # Flutter Version Manager
brew "cocoapods"        # iOS Dependencies
brew "scrcpy"           # Android Mirroring

# ==============================================
# 3. GUI APPLICATIONS
# ==============================================
cask "warp"             # AI-Powered Terminal
cask "visual-studio-code"
cask "brave-browser"    # Privacy-focused Browser
cask "raycast"          # Spotlight Replacement
cask "docker"
cask "tableplus"        # Database GUI
cask "shottr"           # Precision Screenshot Tool
cask "rectangle"        # Window Snapping Manager
cask "appcleaner"       # Thorough App Uninstaller
cask "the-unarchiver"   # RAR/7z Manager

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

# ==============================================
# 4. SECURITY & PRIVACY
# ==============================================
cask "bitwarden"        # Password Manager (Open Source)
cask "mullvad-vpn"      # Privacy VPN (No Email Req)

# ==============================================
# 5. CREATIVE & LIFESTYLE (Optional)
# ==============================================
cask "figma"            # UI Design
cask "darktable"        # Photography (Lightroom Alt)
brew "imagemagick"      # CLI Image Tools

cask "telegram"         # Messaging
cask "spotify"          # Music

# Video & Gaming
cask "iina"             # Modern Video Player
cask "stremio"          # Streaming Aggregator
cask "whisky"           # Windows Gaming (GPTK Wrapper)

# ==============================================
# 6. LOCAL AI (Uncomment if needed)
# ==============================================
# brew "ollama"           # Local LLM Backend
# cask "chatbox"          # GUI for Ollama