# Brewfile

# --- TAPS ---
tap "leoafarias/fvm"
tap "jcyrus/homebrew-tap"

# --- 1. CORE CLI ---
brew "git"
brew "gh"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "jq"
brew "starship"
brew "mas"

# --- 2. STACKS ---
brew "rustup-init"
brew "bacon"
brew "cargo-binstall"
brew "fnm"
brew "pnpm"
brew "leoafarias/fvm/fvm"
brew "cocoapods"
brew "scrcpy"

# --- 3. GUI APPS ---
cask "warp"
cask "visual-studio-code"
cask "brave-browser"
cask "google-chrome"
cask "raycast"
cask "orbstack"
cask "tableplus"
cask "shottr"

cask "appcleaner"
cask "the-unarchiver"
cask "font-fira-code"
cask "font-jetbrains-mono"

# --- 4. SECURITY ---
cask "bitwarden"
cask "mullvad-vpn"

# --- 5. EXTRAS ---
cask "figma"
cask "darktable"
brew "imagemagick"
cask "telegram"
cask "spotify"
cask "iina"
cask "stremio"
cask "whisky"
cask "ghostwire"
cask "spektr"

# --- 6. OPTIONAL (Uncomment to install) ---
# cask "iterm2"
# cask "discord"
# cask "slack"
# cask "zoom"
# cask "obsidian"
# cask "postman"
# cask "vlc"